NewFile.xml

<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:kim="http://techquest.interswitchng.com/kimono/"> <soap12:Header>
<isw:SecurityToken xmlns:isw="http://techquest.interswitchng.com/">****************************************************************************************************************************************************************************************************************************************************************************************************************************************************************</isw:SecurityToken>
<MAC>e8bd4f78</MAC>
</soap12:Header>
<soap12:Body>
<kim:KMsg>
<kim:KMsgRequest>
<kim:Scheme>paywithmobile</kim:Scheme>
<kim:App>getbalance</kim:App>
<kim:AcquirerId>n/a</kim:AcquirerId>
<kim:Version>5.0</kim:Version>
<kim:Channel>
</kim:Channel>
<kim:Username/>
<kim:Password/>
<kim:TermInfo>
<kim:Mid>QTMOBILE1ISSBIS</kim:Mid>
<kim:Tid>2348038831043</kim:Tid>
<kim:Lang>en</kim:Lang>
</kim:TermInfo>
<kim:Request>
<kim:Ttid>A</kim:Ttid>
<kim:CardName>default</kim:CardName>
<kim:PaymentMethodTypeCode>VVC</kim:PaymentMethodTypeCode>
<kim:PaymentMethodCode>FBN</kim:PaymentMethodCode>
<kim:CVV2>***</kim:CVV2>
<kim:ExpDate>
</kim:ExpDate>
<kim:PanData>
</kim:PanData>
<kim:OTP>
</kim:OTP>
<kim:PinData>****************</kim:PinData>
<kim:Secure>********************************************************************************************************************************</kim:Secure>
</kim:Request>
</kim:KMsgRequest>
</kim:KMsg>
</soap12:Body>
</soap12:Envelope>